nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_33OHM 0x3000u    /*!<@brief Selects transmitter current drive 33ohm */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PULLUP_EN 0x20u        /*!<@brief Enable pull-up function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name PIO7_3 (coord C21), SD_VSELECT
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_VSELECT_PERIPHERAL GPIO7         /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_VSELECT_SIGNAL GPIO              /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_VSELECT_CHANNEL 3                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD_VSELECT_GPIO GPIO7               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_VSELECT_GPIO_PIN_MASK (1U << 3U) /*!<@brief GPIO pin mask */
#define BOARD_INITSDHCPINS_SD_VSELECT_PORT 7U                  /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_VSELECT_PIN 3U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SD_VSELECT_PIN_MASK (1U << 3U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PIO7_11 (coord F18), SD_CARD_DET_N
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_CHANNEL 11                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SD_CARD_DET_N_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name PIO7_10 (coord A24), SD_PWREN_B
  @{ */
/* Routed pin properties */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PERIPHERAL GPIO7          /*!<@brief Peripheral name */
#define BOARD_INITSDHCPINS_SD_PWREN_B_SIGNAL GPIO               /*!<@brief Signal name */
#define BOARD_INITSDHCPINS_SD_PWREN_B_CHANNEL 10                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITSDHCPINS_SD_PWREN_B_GPIO GPIO7                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_PWREN_B_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PORT 7U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITSDHCPINS_SD_PWREN_B_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHCPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

