nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/common/pin_mux/cm33_core0/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_GRN_GPIO GPIO1                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GRN_GPIO_PIN_MASK (1U << 13U)          /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_GRN_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_GRN_PIN 13U                            /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_GRN_PIN_MASK (1U << 13U)               /*!<@brief PORT pin mask */
                                                                      /* @} */

/*! @name PIO0_19 (number AB24), LED_BLU
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_LED_BLU_PERIPHERAL GPIO0                   /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_LED_BLU_SIGNAL GPIO                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_LED_BLU_CHANNEL 19                         /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_BLU_GPIO GPIO0                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLU_GPIO_PIN_MASK (1U << 19U)          /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_BLU_PORT 0U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BLU_PIN 19U                            /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_BLU_PIN_MASK (1U << 19U)               /*!<@brief PORT pin mask */
                                                                      /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI0Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_FUNC3 0x03u            /*!<@brief Selects pin function 3 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_EN 0x10u          /*!<@brief Enable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI1Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u     /*!<@brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitXSPI2Pins(void); /* Function assigned for the Cortex-M33 (Core #0) */

/*!
 * @brief Analog mux is disabled */
#define IOPCTL_PIO_ANAMUX_DI 0x00u
/*!
 * @brief Selects transmitter current drive 100ohm */
#define IOPCTL_PIO_DRIVE_100OHM 0x00u
/*!
 * @brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC0 0x00u
/*!
 * @brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_DI 0x00u
/*!
 * @brief Input function is not inverted */
#define IOPCTL_PIO_INV_DI 0x00u
/*!
 * @brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u
/*!
 * @brief Enable pull-down function */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u
/*!
 * @brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u
/*!
 * @brief Normal mode */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u
/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SCL_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SCL_ODENA_ODENA_1 0x01u
/*!
 * @brief Input Buffer Enable: Enables */
#define PMIC_I2C_SDA_IBENA_IBENA_1 0x01u
/*!
 * @brief Open-drain Mode Enable: Enables for simulated open-drain output (high drive disabled) */
#define PMIC_I2C_SDA_ODENA_ODENA_1 0x01u

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMICPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

